{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\uc774\ubd84\ubc95\uc801 \uc0ac\uace0",
    "1": "\uacfc\uc789\uc77c\ubc18\ud654",
    "2": "\uc815\uc2e0\uc801 \uc5ec\uacfc",
    "3": "\uae0d\uc815 \ubb34\uc2dc",
    "4": "\uc131\uae09\ud55c \uacb0\ub860",
    "5": "\uacfc\uc7a5 \ubc0f \ucd95\uc18c",
    "6": "\uac10\uc815\uc801 \ucd94\ub860",
    "7": "\ub2f9\uc704\uc801 \uc0ac\uace0",
    "8": "\uac1c\uc778\ud654",
    "9": "\ub099\uc778\ucc0d\uae30",
    "10": "\ube44\uc778\uc9c0\uc65c\uace1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uac10\uc815\uc801 \ucd94\ub860": 6,
    "\uac1c\uc778\ud654": 8,
    "\uacfc\uc789\uc77c\ubc18\ud654": 1,
    "\uacfc\uc7a5 \ubc0f \ucd95\uc18c": 5,
    "\uae0d\uc815 \ubb34\uc2dc": 3,
    "\ub099\uc778\ucc0d\uae30": 9,
    "\ub2f9\uc704\uc801 \uc0ac\uace0": 7,
    "\ube44\uc778\uc9c0\uc65c\uace1": 10,
    "\uc131\uae09\ud55c \uacb0\ub860": 4,
    "\uc774\ubd84\ubc95\uc801 \uc0ac\uace0": 0,
    "\uc815\uc2e0\uc801 \uc5ec\uacfc": 2
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32000
}
